src/cf/InformationRegisters/НастройкиПодключенияТСПИоТМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияТСПИоТМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутПроверкиКодаМаркировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭкземпляраТСПИоТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерФискальногоНакопителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияТСПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияТСПИоТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутПроверкиКодаМаркировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭкземпляраТСПИоТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РабочиеМестаИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерФискальногоНакопителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияТСПИоТМДЛП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает признак, что проверка разрешительного режима настроена через ТС ПИоТ для ФН.
//
// Параметры:
//  НомерФискальногоНакопителя - Строка - номер фискального накопителя.
//  ККТФФД12МДЛП - СправочникСсылка.ПодключаемоеОборудование - ссылка на справочник подключаемого оборудования,
//                 при использовании БПО.
//
// Возвращаемое значение:
//  Структура - результат проверки настройки:
//   * Настроено - Булево - Истина, если для указанного ФН используется проверка кодов маркировки через ТС ПИоТ.
//   * НастройкиПодключения - см. ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ.
//
Функция НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП) Экспорт
	
	СтруктураВозврата = НастройкиПодключенияЭкземпляраТСПИоТ_БПО(ККТФФД12МДЛП);
	Если СтруктураВозврата.Настроено Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Настроено",            Ложь);
	СтруктураВозврата.Вставить("НастройкиПодключения", ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ());
	
	Если Не ЗначениеЗаполнено(НомерФискальногоНакопителя) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НЕОПРЕДЕЛЕНО                                    КАК ТСПИоТ,
	|	ЛОЖЬ                                            КАК ВнутреннийТСПИоТ,
	|	НастройкиПодключенияТСПИоТ.Адрес                КАК АдресПодключения,
	|	НастройкиПодключенияТСПИоТ.ОбменНаСервере       КАК ОбменНаСервере,
	|	НастройкиПодключенияТСПИоТ.Сервер               КАК Адрес,
	|	НастройкиПодключенияТСПИоТ.Порт                 КАК Порт,
	|	НастройкиПодключенияТСПИоТ.ЗащищенноеСоединение КАК ЗащищенноеСоединение
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияТСПИоТМДЛП КАК НастройкиПодключенияТСПИоТ
	|ГДЕ
	|	НастройкиПодключенияТСПИоТ.НомерФискальногоНакопителя = &НомерФискальногоНакопителя
	|");
	
	Запрос.УстановитьПараметр("НомерФискальногоНакопителя", НомерФискальногоНакопителя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкиПодключения = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ();
		ЗаполнитьЗначенияСвойств(НастройкиПодключения, Выборка);
		
		НастройкиПодключения.ПодключаемоеОборудование              = ККТФФД12МДЛП;
		НастройкиПодключения.ИсключитьПроверкуКорневыхСертификатов = Истина;
		
		СтруктураВозврата.Настроено            = Истина;
		СтруктураВозврата.НастройкиПодключения = НастройкиПодключения;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция возвращает дополнительные данные для запроса в ТС ПИоТ.
// Передача этих данных помогает сократить запрос на сервер при установке ТС ПИоТ на клиенте.
//
// Параметры:
//  НомерФискальногоНакопителя - Строка - номер фискального накопителя.
//
// Возвращаемое значение:
//  Структура - Дополнительные данные запроса ТС ПИоТ:
// * ДанныеКлиента -  Структура из КлючИЗначение:
//    ** НаименованиеКассовогоПО  - Строка - Наименование ПМСР (кассового ПО)
//    ** ВерсияКассовогоПО        - Строка - Версия ПМСР (кассового ПО)
//    ** ИдентификаторКассовогоПО - Строка - Идентификатор ПМСР (кассового ПО) в реестре ГИС МТ
//    ** КонтрольнаяСумма         - Строка - Контрольная сумма/ЭЦП исполняемого файла ПМСР (кассового ПО)
//
Функция ДополнительныеДанныеЗапросаТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП) Экспорт
	
	// ГосИС
	СтруктураДополнительныхПараметровГосИС = ДополнительныеДанныеЗапросаТСПИоТГосИС(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	Если СтруктураДополнительныхПараметровГосИС <> Неопределено Тогда
		Возврат СтруктураДополнительныхПараметровГосИС;
	КонецЕсли;
	// Конец ГосИС
	
	СтруктураДополнительныхПараметров = Новый Структура;
	
	ВерсияБиблиотеки       = ОбновлениеИнформационнойБазыМДЛП.ВерсияБиблиотеки();
	НаименованиеБиблиотеки = "БиблиотекаИнтеграцииМДЛП";
	
	ДанныеКлиента = Новый Структура;
	
	ДанныеКлиента.Вставить("НаименованиеКассовогоПО" , НаименованиеБиблиотеки);           // Наименование ПМСР (кассового ПО)
	ДанныеКлиента.Вставить("ВерсияКассовогоПО"       , ВерсияБиблиотеки);                 // Версия ПМСР (кассового ПО)
	ДанныеКлиента.Вставить("ИдентификаторКассовогоПО", ИдентификаторПМСР_ТСПИоТ());       // Идентификатор ПМСР (кассового ПО) в реестре ГИС МТ
	ДанныеКлиента.Вставить("КонтрольнаяСумма"        , ХэшСуммаСтроки(ВерсияБиблиотеки)); // Контрольная сумма/ЭЦП исполняемого файла ПМСР (кассового ПО)
	
	СтруктураДополнительныхПараметров.Вставить("ДанныеКлиента", ДанныеКлиента);
	
	Возврат СтруктураДополнительныхПараметров;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция НастройкиПодключенияЭкземпляраТСПИоТ_БПО(ККТФФД12МДЛП)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Настроено",            Ложь);
	СтруктураВозврата.Вставить("НастройкиПодключения", ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ());
	
	Если КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
		
		МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияТСПИоТ");
		НастроенныйТСПИоТ = МодульМенеджера.ПолучитьТСПИоТ(ККТФФД12МДЛП);
		
		Если ЗначениеЗаполнено(НастроенныйТСПИоТ) Тогда
			
			НастройкиПодключения = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ();
			
			НастройкиПодключения.ПодключаемоеОборудование = ККТФФД12МДЛП;
			НастройкиПодключения.ТСПИоТ                   = НастроенныйТСПИоТ;
			
			ИмяПеречисления         = "ТипыТСПИоТ";
			ИмяЗначенияПеречисления = "Внутренний1С";
			
			УстановитьПривилегированныйРежим(Истина);
			
			РеквизитыНастроенногоТСПИоТа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастроенныйТСПИоТ,
				"Тип, Сервер, Порт, ЗащищенноеСоединение, Таймаут, ОбменНаСервере, ИсключитьПроверкуКорневыхСертификатов");
			
			НастройкиПодключения.ВнутреннийТСПИоТ = (РеквизитыНастроенногоТСПИоТа.Тип = Перечисления[ИмяПеречисления][ИмяЗначенияПеречисления]);
			
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Не НастройкиПодключения.ВнутреннийТСПИоТ Тогда
				ЗаполнитьЗначенияСвойств(НастройкиПодключения, РеквизитыНастроенногоТСПИоТа);
				НастройкиПодключения.Адрес = РеквизитыНастроенногоТСПИоТа.Сервер;
			КонецЕсли;
			
			НастройкиПодключения.АдресПодключения  = СтрШаблон(НСтр("ru = '%1://%2:%3'"),
				?(РеквизитыНастроенногоТСПИоТа.ЗащищенноеСоединение, "https", "http"),
				РеквизитыНастроенногоТСПИоТа.Сервер,
				?(ЗначениеЗаполнено(РеквизитыНастроенногоТСПИоТа.Порт), РеквизитыНастроенногоТСПИоТа.Порт, ?(РеквизитыНастроенногоТСПИоТа.ЗащищенноеСоединение, "443", "80")));
			
			СтруктураВозврата.Настроено            = Истина;
			СтруктураВозврата.НастройкиПодключения = НастройкиПодключения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ИдентификаторПМСР_ТСПИоТ()
	
	Возврат "96d4f181-9f4d-42eb-8885-8a8485e816fd";
	
КонецФункции

// Хэш сумма строки.
// 
// Параметры:
//  СтрокаДляРасчетаХеша - Строка - Строка для расчета хеша
// 
// Возвращаемое значение:
//  Строка - Хэш сумма строки
//
Функция ХэшСуммаСтроки(СтрокаДляРасчетаХеша)
	
	ХешированиеДанныхОбъект = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешированиеДанныхОбъект.Добавить(СтрокаДляРасчетаХеша);
	
	Возврат Base64Строка(ХешированиеДанныхОбъект.ХешСумма);
	
КонецФункции


// ГосИС

Функция ДополнительныеДанныеЗапросаТСПИоТГосИС(НомерФискальногоНакопителя, ККТФФД12МДЛП)
	
	Если ОбщегоНазначенияБПО.ИспользуетсяГосИС() Тогда
		Попытка
			МодульИнтеграцияТСПИоТ = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияТСПИоТ");
		Исключение
			МодульИнтеграцияТСПИоТ = Неопределено;
		КонецПопытки;
	Иначе
		МодульИнтеграцияТСПИоТ = Неопределено;
	КонецЕсли;
	
	Если МодульИнтеграцияТСПИоТ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиПодключенияГосИС = НастройкиПодключенияЭкземпляраТСПИоТГосИС(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	Если Не НастройкиПодключенияГосИС.Настроено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиПодключенияМДЛП  = НастройкиПодключенияЭкземпляраТСПИоТ(НомерФискальногоНакопителя, ККТФФД12МДЛП);
	
	СвойстваСравнения = Новый Массив;
	СвойстваСравнения.Добавить("Адрес");
	СвойстваСравнения.Добавить("Порт");
	
	// Проверяем отличие настроек. Если настройки отличаются, то дополнительные данные запроса ТС ПИоТ ГосИС не используем для МДЛП.
	Для Каждого ИмяСвойства Из СвойстваСравнения Цикл
		Если НастройкиПодключенияГосИС.НастройкиПодключения[ИмяСвойства] <> НастройкиПодключенияМДЛП.НастройкиПодключения[ИмяСвойства] Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыСканирования = Новый Структура;
	ПараметрыСканирования.Вставить("ККТФФД12МДЛП", ККТФФД12МДЛП);
	ПараметрыСканирования.Вставить("НомерФискальногоНакопителя", НомерФискальногоНакопителя);
	ПараметрыСканирования.Вставить("Организация", ККТФФД12МДЛП.Организация);
	
	СтруктураДополнительныхПараметровИсходная = МодульИнтеграцияТСПИоТ.ДополнительныеДанныеЗапросаТСПИоТ(ПараметрыСканирования);
	
	СтруктураДополнительныхПараметров = Новый Структура;
	СтруктураДополнительныхПараметров.Вставить("ДанныеКлиента");
	
	ЗаполнитьЗначенияСвойств(СтруктураДополнительныхПараметров, СтруктураДополнительныхПараметровИсходная);
	
	Возврат СтруктураДополнительныхПараметров;
	
КонецФункции

Функция НастройкиПодключенияЭкземпляраТСПИоТГосИС(НомерФискальногоНакопителя, ККТФФД12МДЛП)
	
	СтруктураВозврата = НастройкиПодключенияЭкземпляраТСПИоТ_БПО(ККТФФД12МДЛП);
	Если СтруктураВозврата.Настроено Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Настроено",            Ложь);
	СтруктураВозврата.Вставить("НастройкиПодключения", ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ());
	
	Если Не ЗначениеЗаполнено(НомерФискальногоНакопителя) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НЕОПРЕДЕЛЕНО                                    КАК ТСПИоТ,
	|	ЛОЖЬ                                            КАК ВнутреннийТСПИоТ,
	|	НастройкиПодключенияТСПИоТ.Адрес                КАК АдресПодключения,
	|	НастройкиПодключенияТСПИоТ.ОбменНаСервере       КАК ОбменНаСервере,
	|	НастройкиПодключенияТСПИоТ.Сервер               КАК Адрес,
	|	НастройкиПодключенияТСПИоТ.Порт                 КАК Порт,
	|	НастройкиПодключенияТСПИоТ.ЗащищенноеСоединение КАК ЗащищенноеСоединение
	|ИЗ
	|	РегистрСведений.НастройкиПодключенияТСПИоТ КАК НастройкиПодключенияТСПИоТ
	|ГДЕ
	|	НастройкиПодключенияТСПИоТ.НомерФискальногоНакопителя = &НомерФискальногоНакопителя
	|");
	
	Запрос.УстановитьПараметр("НомерФискальногоНакопителя", НомерФискальногоНакопителя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкиПодключения = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПараметрыПодключенияТСПИоТ();
		ЗаполнитьЗначенияСвойств(НастройкиПодключения, Выборка);
		
		СтруктураВозврата.Настроено            = Истина;
		СтруктураВозврата.НастройкиПодключения = НастройкиПодключения;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Конец ГосИС

#КонецОбласти // СлужебныеПроцедурыИФункции
